[
  {
    "id": "jg-lead",
    "company": "JustGiving",
    "role": "Front-end community lead",
    "from": "2017",
    "to": "present",
    "details": "JustGiving is one of the worlds largest online giving platforms. Have worked across several teams in the company working on various projects to modernise JustGiving’s front-end applications using React.\n\nAs well as my current role as a Javascript engineer on the crowdfunding product I also lead the front-end community at JustGiving.",
    "responsibilities": [
      "Mentor junior developers to help them in their careers",
      "Core contributor to the shared component library that is used throughout JustGiving products",
      "Manage frontend recruitment to ensure candidates are both technically sound but also a culture fit at JustGiving"
    ]
  },
  {
    "id": "jg",
    "company": "JustGiving",
    "role": "Javascript engineer",
    "from": "2016",
    "to": "present",
    "details": "Have worked across multiple teams within JustGiving working on some of JustGiving’s core products, the fundraising and crowdfunding product.",
    "responsibilities": [
      "Part of a cross-functional team tasked with rebuilding the fundraising page, JustGiving’s core products, using React and Redux",
      "Core member of a development team which maintains and engineers new functionality to JustGiving’s crowdfunding platform; a large scale React/Redux app written in TypeScript",
      "Created an analytics React component library which easily allows developers to integrate analytics tracking into React projects"
    ]
  },
  {
    "id": "ibm",
    "company": "IBM",
    "role": "Front-end developer",
    "from": "June 2015",
    "to": "September 2015",
    "details": "Four month contract in IBM's design studio as a front-end developer. Part of a team tasked with finding new ways to communicate IBM's Design Thinking. The project went on to win an IDI award for best Design Education and Industry project.",
    "responsibilities": [
      "Working with designers to rapidly build prototypes to validate concepts",
      "Working with the team to build a working prototype of the system we proposed, which was eventually presented to the President and Chief Technical Officer of IBM Design"
    ]
  },
  {
    "id": "software-design",
    "company": "Software design",
    "role": "Web developer",
    "from": "2014",
    "to": "2015",
    "details": "Software design is a software development company based in the digital hub in Dublin. I joined them for a 5 month work placement as a web developer. As a result of my performance, I was offered a part time position while I continued my studies.",
    "responsibilities": [
      "Working as part of the development team to build commercial applications and websites",
      "Working closely with UX/UI designers to ensure the finished application/website met the high standards the firm was known for",
      "Provided client facing support/training on all finalised products"
    ]
  },
  {
    "id": "prop-me-up",
    "company": "Prop Me Up",
    "role": "Front-end developer",
    "from": "2011",
    "to": "2014",
    "details": "Prop Me Up is an events company based in Dublin. I joined them as a front-end developer,  building their websites and custom backend system.",
    "responsibilities": [
      "Design, development and maintenance of fully functioning websites. Several of these were integrated with the businesses custom backend systems",
      "Working with backend developers to add new features to the website/backend systems",
      "Working with an SEO expert to ensure the website ranked as high as possible organically"
    ]
  }
]
